"""
plugin for ultroid by @itzyournil and @moon_knight69
✘ Commands Available
✘ প্রকাশ করুন আপনার আবেগ বাংলা ভাষায়

> CMD: `{i}b-feel`
"""

from telethon import events
import random, re
from . import ultroid_cmd

RUNSREACTS = [
    "''উড়তে শিখে গেলে পাখি ভুলে যায় তার একসময়ের অসহায়ত্বের কথা ,",

    "যোগাযোগ করি না, করতে ইচ্ছে হয়না তার অর্থ এই না যে ভুলে গেছি বা রাগ করে আছি দুরত্বের একটা ভাষা থাকে।🤲🙂",

     "কিছু মানুষ আছে, যারা নির্দিষ্ট একটা মানুষের জন্য শতজনকেও উপেক্ষা করতে পারে!; 🥀",

    "পরিস্থিতি যেমনই হোক যে ভালোবাসে, সে কখনো ছেড়ে যায় না-!🖤🌻 ভালোবাসা মানেই অল্প 𝐒𝐚𝐜𝐫𝐢𝐟𝐢𝐜𝐞 আর অনেকটা 𝐂𝐚𝐫𝐞 করা!🙂🌺🌿.",

    "পৃথিবীর সবচেয়ে বা জে জিনিসের মধ্যে একটা হচ্ছে 'এক্সপেকটেশন', না চাইতেও আমরা ভুল মানুষের কাছে আবদার করে বসি,প্রায়োরিটি চাই,একটু কেয়ার চাই!🌸 ",
    "শাড়ি পড়লে মেয়েদের সবথেকে বেশি সুন্দর লাগে । আপনি কালো না ফর্সা, মোটা না চিকন, লম্বা না খাটো এসব কোন ব্যাপারই না! আপনি যেমনই হোন, শাড়ি আপনার সৌন্দর্য দশগুণ বাড়িয়ে দেয় । কুঁচি করতে পারেন না? ঐটাই সৌন্দর্য । এলোমেলো শাড়ি পড়েন ? ঐটাই সৌন্দর্য ।নারী মানেই শাড়ি, শাড়ি মানেই সৌন্দর্য!♡",
    "কারো ব্যক্তিত্বের প্রেমে পড়ার মতো বিপদজনক জিনিস খুব কম ই আছে। সুন্দর চেহারা একদিন,দুই দিন বা এক দুই মাস ভালো লাগে,এরপর আর না। অথচ কারো ব্যক্তিত্ব ভালো লেগে গেলে,সে মানুষ টা যা ই করুক,সেটাই ভাল্লাগে। তার সাথে একটু কথা বললেই ভাল্লাগে, তার কথা মন্ত্রমুগ্ধের মতো শুনতে ভাল্লাগে,সে মানুষ টা হাসলে ভাল্লাগে,তার চলাফেরা ভাল্লাগে। একটা অদ্ভুত টান কাজ করে তার প্রতি!🖤",
    "মানুষ যখন কারো 'প্রশংসা' করে, তখন খুব কম লোক তা বিশ্বাস করে🥀কিন্তু যখন কিনা তার 'বদনাম' করা হয়, তখন প্রায় সবাই তা বিশ্বাস করে🌸",
    "ভালোবাসার মানুষকে নিজের করে পেয়ে গেলে, মানুষের বেঁচে থাকার আনন্দ দ্বিগুণ বেড়ে যায়।🤍🌸.",

    "মানুষ আমি একটাই।তবে ব্যাক্তি ভাগে আমার চরিত্র গুলো আলাদা আলাদা। কারো কাছে আমি এক গম্ভীর মানুষ, কারো কাছে বদমেজাজি, কারো কাছে খুবই ফানি, কারো কাছে হয়তো খুব রোমান্টিক, অনেকর কাছে খুব ভদ্র এবং ভালো মানুষ। আবার কারো কাছে পৃথিবীর সবথেকে খারাপ মানুষটি আমি। তবে মানুষ কিন্তু আমি একটাই!",
    "আপনাকে নয় আপনার পজিশনকে মানুষ সম্মান করে। তাই পজিশন তৈরিতে কখনো আপোষ করবেন না!",

    "প্রিয় মানুষ ছেড়ে চলে যাবে! বেস্টফ্রেন্ড অন্য বেষ্টফ্রেন্ড বানাবে! ফ‍্য‍ামিলি প্র'বলেম বেড়ে যাবে! ডি'প্রেসড লাগবে! একাকিত্বে ডুবে যাবে! তবুও থেমে থাকা যাবে না!🖤জীবন সুন্দর!🌸",
    "যে সুখের আশায় ছেড়ে গিয়ে দুঃখ দিলে আমায়,দু-হাত তুলে প্রার্থনা করি সে সুখ যেন তোমাকে ছেড়ে না যায়🌸🖤",

    "যে গোপনে আসিয়াছিল, তাহাকে গোপনেই যাইতে  দিলাম। কিন্তু এই নির্জন নিশীথে সে যে তাহার কতোখানি আমার কাছে ফেলিয়া রাখিয়া গেল, তাহা কিছুই সে জানিতে পারিল না। 💙",
    " জীবন বড়ই বিচিত্র : সন্ধ্যা কাটেনা অথচ দিব্যি বছর কেটে যাচ্ছে!❣️",

"সুন্দর একটি মৃ-ত্যুর অপেক্ষায় বেঁচে থাকার নাম জীবন!❤️",
"বুঝলে প্রিয়‚ জীবনটাই শ্রেয় — সব প্রতিশ্রুতি‚ মিথ্যে ঠোঁটের ছোঁয়া;শরীর বেয়ে নেমে চলা শীতল স্পর্শ‚সময়ের বদলে হয় সব ধোঁয়া...!"
"𝐁𝐞𝐥𝐢𝐞𝐯𝐞𝐝 𝐎𝐫 𝐍𝐨𝐭 দুই নারীর বন্ধুত্ব দুই পুরুষের বন্ধুত্বের মতো এতো শক্তিশালী নয়। 😑✌",

"তাদের সাথে আমি যেমন,তারাও আমার সাথে ঠিক তেমনই হবে -তেমনই থাকবে! কিছু ভুল মানুষের কাছে এই ভুল প্রত্যাশা কইরা বরাবর আমি নিজেই নিজের মন ভাঙি 😅💔🥀",
"তোমার আমার মিলন হওয়া আর কখনোই সম্ভব না😊 আমি আজ না চাইতেও অন্য কারো হয়ে গেলাম যে কিছু কিছু গল্প এমনও আছে! মে'য়েটা থাকতে চেয়েছিল কিন্তু ছে'লেটা রাখেনি!আর সেই হতভাগী মেয়েটাই হয়তো আমি🙃🙂",
" পৃথিবীর সবচেয়ে দামী বস্তু হচ্ছে- সময়।তোমাকে আমি সময় দিয়েছি মানে, আমার জীবনের একটা অংশ তোমাকে দিয়ে দিয়েছি।যা এই পৃথিবী লণ্ডভণ্ড করেও আমি আর ফেরত পাবো না এবং তোমাকেউ নাহ😅 ",
    "ভালোবাসায় শূন্য এখন , জীবনটা কষ্ট দিয়ে ভরপুর 💔",
    " পথ ভুলে গেলাম তোর গলিতে , এখন সেই গলি আমার গলার কাঁটা ",
    "পৃথিবীতে প্রতিটি মানুষই যেন বহুরুপী, যে যতটুকু দেখায় আমরা ততটুকুই বুঝি ।",
    "প্রেমে পড়া খুব সহজ তবে তাকে ভালোবেসে আমৃত্যু নিজের মতো করে আগলে রাখা বড্ড কঠিন।",
    "কিছু কিছু সফলতার গল্পের সাথে নারীর অবদান থাকে। সব নারীই খারাপ হয় নাহ💔🙂",
    "আসলে সে আমারে না অন্য কাউরে ভালোবাসতো , আমার দিকে তাকিয়ে সে আমারে না অন্য কাউরে দেখতো।। 🖤🥀",
    "যোগাযোগ বিচ্ছিন্ন হতে পারে। সম্পর্কো বিচ্ছিন্ন হতে পারে কিন্তু ভালোবাসা থেকে যায়।  হয়তো আক্ষেপে নয়তো অপেক্ষায়!💗",
    "বন্ধু হলো যাকে কখনো আলাদাভাবে বলতে হয়না ‘ভালোবাসি’মুখের ভাষার তখনই প্রয়োজন হয়, যখন হৃদয় নীরবতার ভাষায় ভালোবাসা বিনিময় করতে পারেনা, আর মুখের ভাষা মিথ্যা হতে পারে হৃদয়ের নীরব ভাষা নয়!"
]

@ultroid_cmd(pattern="b-feel")
async def _(event):
    if event.fwd_from:
         return
    bro = random.randint(0, len(RUNSREACTS) - 1)    
    reply_text = RUNSREACTS[bro]
    await event.edit(reply_text)