# < Source - t.me/testingpluginnn >
# < https://github.com/TeamUltroid/Ultroid >

"""
✘ Flirt Slangs (bangla)

> CMD: `{i}bflirt`
"""

from random import choice
from asyncio import sleep
from . import *
from . import ultroid_cmd
lst = [
    "আপনার প্রতি আমার ভালবাসা ডায়রিয়ার মতো, আমি কেবল এটি ধরে রাখতে পারি না।",
    "তোমাকে ছাড়া জীবন হ’ল ভাঙা পেন্সিলের মতো … অর্থহীন।.",
    "আপনি কি কোনও সুন্দর ব্যক্তির ছবি দেখতে চান? (একটি আয়না ধরুন)",
    "আমি কোনও ফটোগ্রাফার নই, তবে আমি আমাদের একসাথে ছবি করতে পারি।.",
    "আমি যদি বর্ণমালাটি পুনর্বিন্যাস করতে পারি তবে আমি ইউ এবং আমি একসাথে রাখতাম।",
    "আমার সেলফোনে কিছু সমস্যা আছে। এটিতে আপনার নম্বর নেই।",
    "আমার টুইটারের দরকার নেই, আমি ইতিমধ্যে আপনাকে অনুসরণ করছি।.",
    "আমি মনে করি আপনি আমার ভিটামিনের অভাবে ভুগছেন।",
    "আপনি কি প্রথম দর্শনে প্রেমে বিশ্বাস করেন, না আমার আবার হাঁটাচলা করা উচিত?",
    "আজি এ চাদনী রাতে প্রাণে লাগে ঢেউ। দু’জনাতে প্রেম করবাে জানবে নাতাে কেউ",
    "তুমি আমায় ভালবাস আমি তােমায় ভালবাসি । তাই রােজ বারে বারে আমি তােমার কাছে আসি।।",
    "অনেক মেয়ের মধ্যে তুমি হও সবার সেরা। তাই তােমায় দেখে আমি হলাম আত্মহারা।।।",
    "দেখতে তুমি লক্ষ্মী কারণ আমার হবু বউ যে তুমি😝",
    "আজকে স্বপ্নে একটা পরী দেখলাম ঠিক তোমার মত🙈",
]
   

@ultroid_cmd(pattern="bflirt?")
async def bflirt(event):
    m = await event.eor("এই যে তুমি! ,একটু শুনবা?.")
    await sleep(3)
    await m.edit(choice(lst))
